#ifndef CONFIG_H_
#define CONFIG_H_

//************************ Тип конфигурации Rov *****************************//
// Simple Rov.
#define ROV_CONF_SIMPLE                                
//************************ /Тип конфигурации Rov ****************************//

//********************** Тип конфигурации моторов ***************************//   
// 2 ходовых мотора, 1 на подъем, смещен к ходовым.
//#define MOTOR_CONF_2FORWARD_1UP_DISPLACED

// 2 ходовых мотора, 1 на подъем, смещен к ходовым, 1 лаговый мотор.
#define MOTOR_CONF_2FORWARD_1UP_DISPLACED_1LAG
//********************** Тип конфигурации моторов ***************************//

//*************************** Настройки UART ********************************//
// Порт UART.
#define UART_PORT           1       

// Скорость порта UART.
#define UART_PORT_SPEED     115200UL                      
//*************************** /Настройки UART *******************************//

//*****************************  TWI скорость  *******************************//
// TWI скорость - 400kHz 
//#define TWI_SPEED                       400000UL    
// TWI скорость - 100kHz
#define TWI_SPEED                       100000UL
//*****************************  /TWI скорость  ******************************//

//******************** Встроенные подтягивающие рез. I2C ********************//
#define TWI_INTERNAL_PULLUPS
//******************* /Встроенные подтягивающие рез. I2C ********************//

//******************************** Тесты ************************************//
// Отладка через UART.
#define DEBUGGING_THROUGH_UART

// Отладка через LED.
//#define LED_DEBUG

// Тест скорости цикла.
//#define DEBUG_SPEED_CYCLE
//******************************** /Тесты ***********************************//

//************************ Настройки Debug UART *****************************//
#ifdef DEBUGGING_THROUGH_UART
  // Порт UART.
  #define UART_DEBUG_PORT         0    
  
  // Скорость порта UART.
  #define UART_DEBUG_SPEED        115200UL    
#endif        
//************************ /Настройки Debug UART ****************************//

//*********************** Настройки PS2 Joystick ****************************//
// Значение нейтрального положения стика на джойстике.
#define PS2_JOYSTICK_DEF_VALUE 123
//*********************** /Настройки PS2 Joystick ***************************//

//******************** Настройки сервопривода камеры ************************//
// Начальный угол наклона камеры.
#define CAMERA_TILT_SERVO_BEGIN                         1200

// Крайнее нижнее положение камеры.
#define CAMERA_TILT_SERVO_DOWN                          600

// Крайнее верхнее положение камеры.
#define CAMERA_TILT_SERVO_UP                            2400

// Промежуток времени в мс, после которого происходит изменение положения камеры. 
// При удержании кнопки камера - вверх или вниз.
#define CAMERA_TILT_SERVO_ANGLE_CHANGE_DELAY            10

// Начальный угол наклона руля высоты.
#define ELEVATOR_TILT_SERVO_BEGIN                       1200

// Крайнее нижнее положение руля высоты.
#define ELEVATOR_TILT_SERVO_DOWN                        600

// Крайнее верхнее положение руля высоты.
#define ELEVATOR_TILT_SERVO_UP                          2400
//******************** /Настройки сервопривода камеры ***********************//

//**************************** Настройки ESC ********************************//
// Тяговый мотор правый, значение сигнала вперед, макс.
#define ESC_MOTOR_RIGHT_SIGNAL_FORWARD_MAX        750

// Тяговый мотор правый, значение сигнала вперед, мин.
#define ESC_MOTOR_RIGHT_SIGNAL_FORWARD_MIN        1500

// Тяговый мотор правый, значение сигнала стоп.
#define ESC_MOTOR_RIGHT_SIGNAL_STOP               1525

// Тяговый мотор правый, значение сигнала назад, макс.
#define ESC_MOTOR_RIGHT_SIGNAL_REVERSE_MAX        2250

// Тяговый мотор правый, значение сигнала назад, мин.
#define ESC_MOTOR_RIGHT_SIGNAL_REVERSE_MIN        1550

// Тяговый мотор левый, значение сигнала вперед, макс.
#define ESC_MOTOR_LEFT_SIGNAL_FORWARD_MAX         750

// Тяговый мотор левый, значение сигнала вперед, мин.
#define ESC_MOTOR_LEFT_SIGNAL_FORWARD_MIN         1500

// Тяговый мотор левый, значение сигнала стоп.
#define ESC_MOTOR_LEFT_SIGNAL_STOP                1525

// Тяговый мотор левый, значение сигнала назад, макс.
#define ESC_MOTOR_LEFT_SIGNAL_REVERSE_MAX         2250

// Тяговый мотор левый, значение сигнала назад, мин.
#define ESC_MOTOR_LEFT_SIGNAL_REVERSE_MIN         1550

// Мотор подъема\спуска, значение сигнала вперед, макс.
#define ESC_MOTOR_UP_SIGNAL_FORWARD_MAX           750

// Мотор подъема\спуска, значение сигнала вперед, мин.
#define ESC_MOTOR_UP_SIGNAL_FORWARD_MIN           1500

// Мотор подъема\спуска, значение сигнала стоп.
#define ESC_MOTOR_UP_SIGNAL_STOP                  1525

// Мотор подъема\спуска, значение сигнала назад, макс.
#define ESC_MOTOR_UP_SIGNAL_REVERSE_MAX           2250

// Мотор подъема\спуска, значение сигнала назад, мин.
#define ESC_MOTOR_UP_SIGNAL_REVERSE_MIN           1550

// Мотор подъема\спуска, значение сигнала вперед, макс.
#define ESC_MOTOR_LAG_SIGNAL_FORWARD_MAX          750

// Мотор подъема\спуска, значение сигнала вперед, мин.
#define ESC_MOTOR_LAG_SIGNAL_FORWARD_MIN          1500

// Мотор подъема\спуска, значение сигнала стоп.
#define ESC_MOTOR_LAG_SIGNAL_STOP                 1525

// Мотор подъема\спуска, значение сигнала назад, макс.
#define ESC_MOTOR_LAG_SIGNAL_REVERSE_MAX          2250

// Мотор подъема\спуска, значение сигнала назад, мин.
#define ESC_MOTOR_LAG_SIGNAL_REVERSE_MIN          1550
//**************************** /Настройки ESC *******************************//

#endif /* CONFIG_H_ */

