//*******************************  Библиотеки  ******************************//
#include "Arduino.h"

// Класс общие типы данных.
#include "Type.h"

#include "Def.h"
//*******************************  /Библиотеки  *****************************//

//********************  Объявление переменных, констант  ********************//
// Структура хранящая текущие значения нажатых кнопок и положения стиков джойстика от PS2.
extern ps2Struct ps2S;

// Структура хранящая предыдущие значения нажатых кнопок и положения стиков джойстика от PS2.
extern rovDataStruct rovDataS;
//********************  /Объявление переменных, констант  *******************//
