//*******************************  Библиотеки  ******************************//
// Класс глобальные переменные.
#include "GlobalVar.h"

#include "Def.h"
//*******************************  /Библиотеки  *****************************//

//********************  Объявление переменных, констант  ********************//
// Структура хранящая текущие значения нажатых кнопок и положения стиков джойстика от PS2.
ps2Struct ps2S;

// Структура хранящая предыдущие значения нажатых кнопок и положения стиков джойстика от PS2.
rovDataStruct rovDataS;
//********************  /Объявление переменных, констант  *******************//
